#1. კომენტარების მეშვეობით დეტალურად ახსენით, თუ რა არის ფუნქცია და ფუნქციის არგუმენტი.
# ფუნქცია არის მაგალითად როცა დავწერთ print გამოტანამდე თავად აანალიზებს
#ფუნქციის არგუმენტებია ის რასაც მატ ვუწერთ ფრჩხილებში ანუ მათი მნიშვნელობა
#2. ჩამოწერე უკვე ნასწავლი ფუნქციის 3-4 მაგალითი.
print(True or False)
name="nino"
print(type(name))
age=12
type(age)
#3. შექმენი for loop(), რომელიც 5-ჯერ გამოიტანს 'hello'-ს.
for i in range(5):
    print("hello")
#4. შექმენი while loop(), რომელიც გამოიტანს 0,1,2,3 ციფრებს.
i = 0
while i <= 3:
    print(i)
    i += 1
