# 1. ამოწმებს, არის თუ არა რიცხვი დადებითი, უარყოფითი ან ნული
number = int(input("შეიყვანეთ რიცხვი: "))
if number > 0:
    print("რიცხვი დადებითია.")
elif number < 0:
    print("რიცხვი უარყოფითია.")
else:
    print("რიცხვი ნულია.")

# 2. ასაკის შემოწმება ხმის მიცემის უფლებისათვის
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
if age >= 18:
    print("შეძლევთ ხმის მიცემას.")
else:
    print("ხმის მიცემის უფლება არ გაქვთ.")

# 3. მოსწავლის შეფასების შემოწმება
grade = int(input("შეიყვანეთ თქვენი შეფასება (0-100): "))
if grade >= 50:
    print("ჩააბარეთ.")
else:
    print("ვერ ჩააბარეთ.")

# 4. რიცხვის შემოწმება, არის თუ არა იგი 10-ზე ნაკლები ან მეტი
number = int(input("შეიყვანეთ რიცხვი: "))
if number < 10:
    print("შემოიტანეთ უფრო დიდი რიცხვი.")
else:
    print("დავალება შეასრულეთ.")

# 5. შედარება ორი რიცხვის
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
if num1 > num2:
    print(f"{num1} უფრო დიდი არის {num2}-ზე.")
elif num1 < num2:
    print(f"{num2} უფრო დიდი არის {num1}-ზე.")
else:
    print("რიცხვები ტოლია.")
