#1. სიაში შეინახეთ 5 რიცხვი, შემდეგ კი დარპინტეთ პირველი და მეოთხე ელემენტების ნამრავლი.
age=[9,10,77,92,73]
print(age[0], age[4])
#2. სიაში შეინახეთ 7 სტრინგი, შემდეგ დაპრინტეთ შუა სტრინგი.
name=["nino","masho",'salome','giorgi','lika','nika','dachi']
print(name[3])
#3. ცვლადში შეინახეთ სტრინგი, შემდეგ კი დაპრინტეთ ამ სტრინგის მხოლოდ მეორე ასო.
name_=["mariami"]
#
#4. ცვლადში შეინახეთ სტრინგი, შემდეგ კი დაპრინტეთ ამ სტრინგის მეორე და მესამე ასო.
name_=["mariami"]
print(name_[1:3] )
#Bonus:
# შექმენით ვენდინგ მანქანის თამაში პითონის მეშვეობით, როგორც გაკვეთილზე გავაკეთე, უნდა გქონდეთ პროდუქტები, მომხმარებელს უნდა შეეძლოს არჩევა რიცხვის მიხედვით, შემდეგ კი უნდა დაუპრინტოს ის პროდუქტი, რომელიც ამოირჩია, პროდუქტები შეინახეთ სიაში
shopping_list=["Tomato " "Potato " "Tangerine " "Meat " "Butter " "Cheese "]
print([shopping_list])
print(shopping_list[int(input("shopping list : "))] )
