# 1) მოცემულ error-ებზე მოიყვანეთ თითო მაგალითი და 
# დაწერეთ თუ როდის ხდება, შემდეგ აირჩიეთ აქედან ერთ-ერთი
#  და try, except, finally-ის მეშვეობით მოეპყარით ამ error-ს,
#  ასევე დაწერეთ რას აკეთბს ეს თითოეული

# # SyntaxError - ხდება მაშინ როდესაც კოდში გვაქვს სინტაქსური შეცდომა, როგორიცაა გამორჩენილი ბრჩხილი, ბრჭყალი
# print("goa"
# TypeError - ხდება მაშინ როდესაც ფუნქციას გადავცემთ არასწორი სახის მონაცემთა ტიპს
# str("goa")
# ValueError - ხდება მაშინ როდესაც ფუნქციას სწორ მონაცემთა ტიპს გადასცემ მაგრამ არასწორ მნიშვნელობას
# int("fgfj")
# ZeroDivisionError - ხდება მაშინ როდესაც რაიმე inter/float ყოფ 0-ზე
#999,5/0
# IndexError - ხდება მაშინ როდესაც iterable-იდან ვცდილობთ ავიღოთ/მივწდეთ იმ ინდექსს რომელზეც ელემენტი არ იმყოფება კონკრეტულ დროს iterable-ში
#name=["oliko","luka","nika" , "dachi"]
#print(name[6])
# NameError - ხდება მაშინ როდესაც ვცდილობთ გამოვიყენოთ ისეთი სახელის მქონე ფუნქცია ან ცვლადი რომელიც ჯერ არ გამოგვიცხადებია
#age=18
#print(lastname)


# try:
#     age=19
#     print(name)
# except NameError:
#     print(NameError)

      
# try ამოწმებს კოდს შეცდომაზე, except ამ შეცდომას იჭერს და ამუშავებს,
#  ხოლო finally ყოველთვის სრულდება, მიუხედავად იმისა მოხდა თუ არა შეცდომა.


# 2) შექმენით პროდუქტების სია, შემდეგ მომხმარებელს შემოაყვანინეთ
# რიცხვი და გადააქციეთ ინტეჯერად დაუმატეთ error handling. 
# შემდეგ შეამოწმეთ თუ შემოყვანილი ინდექსი აღემატება თქვენს 
# სიაში პროდუქტების რაოდენობას და თუ ასეა მაშინ
# raise keyword-ის გამოყენებით ხელოვნურად გამოიწვიეთ error

foods = ["Pizza", "Burger", "Salad", "Pasta"]

try:
    index = int(input("Enter food index: "))
    print("You chose:", foods[index])

except ValueError:
    print("Please enter a number!")
if index > 3:
    raise IndexError()
